{
    "header":"Lesson 1 Coding4Kids",
    "headerText":"What is coding?",
    "lessonText":[
        "Hi! \n\nWelcome to Coding4Kids! \n\nAre you excited to start your coding adventure? \n\nBefore we begin let’s answer the question: What is coding? \nTo answer this question, we have to explore how computers work. \n\nOn tablets, computers, and phones we can play games, watch shows and movies, do homework, and even message or call friends and family! \n\nBut how do computers allow us to do all of those things? \n\nThe answer is because of computer programs and apps. \n\nBut how do we create computer programs? \n\nWe can create computer programs through code!", 
        "break", 
        "Coding is a way for us to communicate with computers! \n\nJust as we may use a variety of languages to communicate with each other English, Spanish, French, Japanese, Chinese, etc. \n\nCode is a language that a computer understands, and we write code to instruct a computer to perform a specific function. \n\nFor example! \n\nIf we wanted to tell the computer to print out “Hello World!” this is what it would look like:\n",
        "Coding also allows us to develop and create websites, games, and apps! \n\nThere are many different coding languages that we can use to communicate with a computer. \n\nSome examples of these coding languages are Python, Java, JavaScript, C, C++ and more! \n\nWe are going to learn Java! \nAlthough these lessons will be focused on teaching you how to code in Java, many Java coding concepts are also used in other coding languages!",
        "How did you feel about the lesson today? \n\nNext, take this quiz to see how much of this lesson you understood!",
        "quiz"
    ],
    "break":["Have you heard of code (or coding) before?"],
    "choices":[["Yes", "No", "I'm not sure"]],
    "quiz":["What is coding?","What is the coding language that we will learn?","Coding4Kids is an example of a…"],
    "quizChoices":[["a. Coding is a way to communicate with pets and animals!","b. Coding is a way for us to communicate with computers and instruct a computer to perform a specific function!","c. Coding is what we put on our toothbrush when we brush our teeth!"],
                   ["a. Python", "b. C++", "c. Java", "d. JavaScript"],
                   ["a. Puzzle", "b. Computer program and app", "c. Way to call and message friends"]
                  ],
    "answers":["b","c","b"],
    "showCode": 2,
    "codeUrl":["https://www.jdoodle.com/embed/v0/3rgy?stdin=0&arg=0&rw=0"]
}