{
    "header":"Lesson 2 Coding4Kids",
    "headerText":"What are variables?",
    "lessonText":[
        "Now that you have learned about what coding is,\n we will start learning some basic Java concepts! \n\nWe know that computers allow us to interact with computers, for example if we play a game, almost everything you see in that game is a variable. \n\nFor example, each game character and game component is represented by a variable and is stored and used within the games code. \n\nVariables are used in games because game characters and the game environment is constantly changing based on your (the user) input. \n\nWithout variables, there would be no variation in the game, and it would be really boring. \nWhen coding, variables are used to store values that are important to the game, program, or application that you may be coding.", 
        "To illustrate exactly what a variable does, picture we have an empty box. \n\n[ ]\n And this box can be filled with a variety of things. \nLet’s fill this box with green balls. \nHere the box represents a variable, and the balls represent the values that we can store in a variable. \n\nNow let’s add a few more boxes, and fill them with purple and red balls. \n\nThese balls also represent values that can be stored in variables (the boxes). \n\nThe different colors that can be stored in these boxes represent the different types of variables that exist. \nIn certain boxes, only green balls can be stored, while in other boxes only purple boxes can be stored. \n\nEach variable (box) can only store a certain kind of color, just as each variable can store a certain type of value. \n\nThere are 5 variables that we use in Java that we will discuss in this lesson. \n\nStrings, Boolean, int, double, and char. \n\nEach of these variables represent a box, but only a certain type of color ball can occupy each box.", 
        "Strings are variables that represent words and characters. \n\nIf we wanted to have a variable store a sentence, we would label that variable a string and set it equal to the words or phrase. \n\nThat may look something like this: \n\nString sentence = “Hello!”; \n\n...But what if we only wanted to store a single letter, then we would use a char variable, and that would look something like this: \n\nChar character = “A”; \n\nChar variables only store a single (one) character or letter of the alphabet.",
        "If we wanted to store numbers we would use a variable called an integer to store a numeric value. \n\nint number = 100;\n\n If we wanted to store a decimal or fraction we would use a variable called a double. \nBoth doubles, and integers store numbers, but doubles store numbers that are not whole numbers. \n\nDouble = 5/2; \nor \ndouble = 10.5; \n\nBoolean variables store true or false. \n\nBoolean code = true;\n",
        "As you may have noticed, in order to code or write a value to a variable we need to first state the type of variable \n\n(Boolean, string, char, int, or double) \n\nand then write the name of the variable (must being with a lowercase), \n\nan equal sign, \n\nand then the value of the variable.",
        "Let’s practice: \n\nIf we want to name a variable giraffe, \nand store the STRING “I am a giraffe” in that variable, \nwhat would that look like? \n\nRemember to write the type of variable, \n\nthen the name, \n\nthen write what that variable name is equal to...",
        "What if we wanted to name a variable five, and store the number 5 in that variable, what would that look like?",
        "Very good! \n\nAre you ready to test your knowledge with a quiz?",
        "quiz"
    ],
    "quiz":["Which type of variable stores fractions and decimals? ", "Which type of variable stores letters or characters?", "How I would write a variable with a name of variableOne with a value of true?", "How I would write a variable with a name of variableTwo with a value of \"this is the value of variableTwo\"?", "How I would write a variable with a name of variableThree with a value of 100?"],
    "quizChoices":[
        ["a. Strings", "b. Boolean", "c. Integers", "d. Double"],
        ["a. char","b. Boolean","c. double", "d. integer"],
        ["a. char variable = t;", "b. String one = \"true\"", "c. boolean variableOne = true;", "d. boolean variableOne = false"],
        ["a. char variable = v;", "b. String variableTwo = \"this is the value of variableTwo\";", "c. String variableOne = true;", "d. int variableTwo = 10"],
        ["a. int variableThree = 100", "b. double variableThree = 10.0;", "c. String variableOne = 100;", "d. int variable = 100"]
    ],
    "answers":["d","a","c","b","a"],
    "inputPages" : [5,6],
    "correctInput": ["String giraffe = \"I am a giraffe\";", "int five = 5;"]
}