{
    "header": "Lesson 4 Coding4Kids",
    "headerText": "If/Else Statements",
    "lessonText": [
        "Now that you have had some practice coding your first Java program, let’s review what you have learned so far...\n\n We know when we use System.out.print(“Insert text here”) \n\nJava will print out the text that is in-between the quotation marks. \n\nBuilding off of this, today we will learn what if and else conditional statements are.",
        "Have you heard of a conditional statement before? \n\nLet’s think about what the word conditional means...\n\n Conditional means that certain conditions or requirements must be met for something to happen.",
        "Where have we heard of a conditional statement before? \n\nWell, have you ever played a game of “Simon Says”? \n\nIn a game of “Simon Says”, one player tells others playing the game what to do and follow their instructions…but there is one condition, \nthe player that tells others what to do must begin their instruction by saying “Simon Says….” \n\nOtherwise, the other players don’t follow their instructions.",
        "For example, when a player says “Simon says…touch your head!”\n\n The other players must touch their head. \n\nBut if the player were to say “Touch your head!” Without saying “Simon says” first…. \nThe other players should not touch their head, and players who do touch their head will lose the game.",
        "In this case, the words “Simon Says” are the condition. \nIf the words “Simon Says…” are said at the beginning of the player’s statement, then the players must follow that instruction. \n\nElse, (if the statement does not begin with “Simon Says”) then the players do not follow that instruction.",
        "In Java, If and Else statements are conditional statements (Just like Simon Says!). \n\nSo, If something is true, then the action that occurs within that IF conditional statement is performed! \n\nIf the conditional statement is not true, then it falls onto the ELSE condition. \n\nLet’s see this in action!",
        "if(Player says “Simon Says…Give a High-Five”){\nPlayers give High-Fives;\n}\nelse{\nPlayers do NOT give High-Fives;\n}\n\nSo, if the IF condition is TRUE, then the Players will give High -Fives since this is the action within the IF brackets{ }. \n\nIf the IF condition is met, then you do not need to perform the action in the ELSE brackets{ }, the Java program simply skips over the ELSE condition only if the previous condition (the IF) is met.",
        "But what happens if the IF condition is FALSE, and the player did not say “Simon Says”… the Java Program would skip over the IF condition and perform the action within the ELSE condition.\n\nYou can have multiple IF conditions, if there are many outcomes and possibilities, but you can only have one Else condition for each IF condition.",
        "Let’s say you have a deck of 4 cards, one is blue, one is red, one is yellow, and one is green. \n\nIf you draw the blue card you increase your score 1 point, if you draw a red card you increase your score 2 points. \nBut, if you draw a yellow card, you decrease your score by 1 point, and if you draw a green card you get 0 and lose 0 points.",
        "How would we write this code?\n\n if (CARD is BLUE)\nSCORE + 1;\nif(CARD is RED)\nSCORE +2;\nif(CARD is YELLOW)\n\tSCORE -1; \nelse\nSCORE +0; \n\nHere the Else condition would only be met if the card is green, otherwise one of the if statements would be “hit” and the action following it would occur. \n\nHowever, this is just one example of how this code would look, there are many different ways to create code to satisfy the conditions. \n\nThis is why coding is so fun! There is never just one solution, everyone’s code can be different and still be valid. \n\nAlways feel free to get creative when coding!",
        "Let’s get some practice by completing the quiz questions for this lesson!",
        "quiz"
    ],
    "quiz":["Let’s say you have a deck of 10 cards, one is blue, one is red, one is yellow, and one is green, and the rest of the cards are black. If you draw the blue card you increase your score 1 point, if you draw a red card you increase your score 2 points. But, if you draw a yellow card, you decrease your score by 1 point, if you draw a green card, you decrease your score by 2 points, and if you draw a black card you get 0 points and lose 0 points.\n\n What would the condition statement look like for a blue card?",
            "Let’s say you have a deck of 10 cards, one is blue, one is red, one is yellow, and one is green, and the rest of the cards are black. If you draw the blue card you increase your score 1 point, if you draw a red card you increase your score 2 points. But, if you draw a yellow card, you decrease your score by 1 point, if you draw a green card, you decrease your score by 2 points, and if you draw a black card you get 0 points and lose 0 points.\n\n What would the condition statement look like for a green card?",
            "Let’s say you have a deck of 10 cards, one is blue, one is red, one is yellow, and one is green, and the rest of the cards are black. If you draw the blue card you increase your score 1 point, if you draw a red card you increase your score 2 points. But, if you draw a yellow card, you decrease your score by 1 point, if you draw a green card, you decrease your score by 2 points, and if you draw a black card you get 0 points and lose 0 points.\n\n If we wanted only wanted to pick a green card, and else we stop playing the game what would that look like?"],
    "quizChoices":[
        ["a. if(CARD is not BLUE) \nSCORE +1;", "b. if(CARD is BLUE) \nSCORE + 0;", "c. if(CARD is BLUE) \nSCORE +1;"],
        ["a. if(CARD is not GREEN) \nSCORE +1;", "b. if(CARD is GREEN) \nSCORE - 2;", "c. if(CARD is GREEN) \nSCORE + 2;"],
        ["a. if(CARD is GREEN) \nKEEP playing game;\nelse\nSTOP playing game;","b. if(CARD is GREEN) \nKEEP playing game; \nelse(STOP playing game)","c. else(KEEP playing game)\nelse if (CARD is GREEN)"]
    ],
    "answers":["c","b","a"]
}